import { WishData, GoldenWishData } from './types';

// The data corresponds to the 8 people mentioned.
// 1-7 are standard friends. 8 is Li Bo (Birthday).
export const WISHES: WishData[] = [
  {
    id: 1,
    name: "咕咕鸡",
    quote: "我认为我休息一下合法的。",
    message: [
      "钵钵鸡 🐔，bo呀bobo ji儿~",
      "以后永远不当BOBO🐔 🚫 ~恢复呼吸！",
      "永远斗志满满 💪、积极向上、永不服输 🔥！"
      ],
    signature: "To 咕咕鸡 🍗"
  },
  {
    id: 2,
    name: "刺猬",
    quote: "我相信我自己，因为终有一天我会成为所有我爱的东西：空气，流水，植物，那个少年。",
    message: [
      "我手劲贼大 💪，你蹼还要么？", 
      "我耳压通了！55555 😭 ~我要发十条小红书！📱",
      "涅槃重生 🌊、无所畏惧、温暖细腻...", 
      "睿智 🌟、努力、热爱生活、积极上进",
      "你的细心温暖感动了周边所有的人 💡，因为你的存在会让生活多了一缕光",
      "这缕光如寒冷冬日的小太阳 ☀️ 温暖着每一个人的心",
      "祝贺你开启新的人生旅程 🎒！"
      ],
    signature: "To 刺猬 🦔"
  },
  {
    id: 3,
    name: "Q",
    quote: "我喜欢纯粹的事务，我不要喜欢酒里掺水，我也这样对待我的生活",
    message: [
      "\"我快饿死了 😋 , 哪吃？\"",
      "大管家",
      "勤劳的订饭 🍱，热情的介绍",
      "细心地看护 🛡️，温暖的鼓励",
      "敢爱敢恨 ❤️‍🔥、热情善良, 为朋友永远冲在第一线！"
      ],
    signature: "To Q子 🍷"
  },
  {
    id: 4,
    name: "雅雅",
    quote: "做你自己，凌驾伤痕 祝“勤奋”的你有一个美好的早晨",
    message: [
      "内个？是不是平谷桃好吃... 🍑",
      "坚毅 🧗‍♀️、勇敢、温暖、溢出屏幕的善良", 
      "做自己 ✨，你是最棒的！"
      ],
    signature: "To 雅雅 🏃‍♀️"
  },
  {
    id: 5,
    name: "猫姐",
    quote: "不要思索，不要理解，只去感受，只去感受！",
    message: [
      "朋友 🤿，学潜水不！当我学生呀！打折！",
      "别走啊 🏃‍♀️，唉~",
      "自律 📸，用心记录美好生活，充满能量的好姐姐！"
      ],
    signature: "To 猫姐 🐱"
  },
  {
    id: 6,
    name: "微辣",
    quote: "去爱永远不会看到第二次的东西，在火焰和狂喊中去爱，人们就在这一瞬间或者",
    message: [
      "我话多吗？🗣️ 憋不了一点！",
      "我二氧化碳没耐受... 🫁",
      "开心最重要 🍦，吃冰棍不？",
      "巧克力 🍫，呵呵~ 活过今夜算我输",
      "热情果敢 🔥、热爱生活、说走就走、能吃能减",
      "救命恩人 🦸‍♀️！"
      ],
    signature: "To 微辣 🌶️"
  },
  {
    id: 7,
    name: "静静",
    quote: "祝勤奋的你有一个美好的早晨！",
    message: [
      "\"你就说这菠萝好不好吃吧！🍍（好吃...😭）\"",
      "\"我请假！🙋‍♀️\"",
      "\"过来🫳🏻我要坐电梯👀👆🛗\"",
      "\"快来🫳🏻我要坐电梯👀👆👆👆🛗\"",
      "\"嘛呢👋，我要坐电梯😡👆👆👆👆👆累着呢！！！！（愤怒点头💢）\"",
      "乐于助人、热情、嫉恶如仇的怨种 👿！"
      ],
    signature: "To 静静 🤫"
  },
  {
    id: 8,
    name: "李博",
    quote: "保持勇敢。保持正直。保持你自己。",
    message: [
      "\"你今天不宜训练\" 🏋️‍♂️",
      "\"溜达串\" 🍡,\"溜达串出摊了\",\"溜达串吗？\",\"灶灶 下楼吧 溜达串\"...",
      "温暖正直是你不变的底色 🛡️",
      "虽然会\"吃亏\"被白嫖 🤝，但你的好大家都看在眼里",
      "散是一粒沙 ✨，聚是满天星!",
      "愿老李的真诚专业能够感染更多人 📢",
      "请把牛逼打在公屏上！",
      "纯粹、温暖 👦、善良、正直、永远18岁的大男孩、值得信赖的\"老骗子\" 🤥",
      "你的礼物是机械魔鬼鱼，比较像你，稳重安逸，无忧无虑，但是有事真上，力量十足，希望老登在你的舒适海洋中翱翔"
    ],
    signature: "To 老李 🎂",
    isSpecial: true,
    danmuConfig: {
      6: ["牛逼", "牛逼!", "老李牛逼!", "NB!", "牛逼", "牛逼plus", "专业","老登生日快乐", "牛逼", "硬核", "牛逼", "666", "牛逼!", "老李牛逼!", "老李666!","老登生日快乐","老登生日快乐"]
    }
  }
];

export const GOLDEN_WISH: GoldenWishData = {
  title: "致 大家",
  quote: "人是自己所有拥有的一切的总和",
  message: [
    "我不善言辞 💻。所以只能通过码农的方式送给大家一些心里话",
    "所有的最可爱的朋友们 💎，你们是我2025年最幸运获得的宝贵的财富，",
    "正因为你们 🌈，",
    "让我重新认识了温暖 ❤️，善良，正直，坚毅，敢爱敢恨，自律，果敢，饱满热情幸福的生活是什么样子，",
    "在我在疲劳的电脑前忙碌时得到温暖 🔋",
    "在我低沉颓废时给我力量 💪",
    "正因为你们 😁，我这一年脸上多了更多笑容",
    "这些话一直想说 💌，借此机会把心底最开心的的喜悦分享给大家。",
    "我也努力以大家为榜样 🐕。希望新的一年也能做到最好的自己。也能够成为大家值得信赖温暖的\"大黄\"。",
    "最后的最后！🎉",
    "回归主角！祝老登生日 🎂 ! 圣诞！新年！去你妹的一辈子没皮没脸快乐！🍾"
  ],
  signature: "From 大黄 🐶"
};